[
{"count": " 129 Candidate Interview Reviews"},
{"q": " Can you tell us about a time you worked with a difficult colleague?   ", "id": 1, "page": "19_IN16"},
{"q": " Describe a situation where you have had to deal with conflict.   ", "id": 2, "page": "19_IN16"},
{"q": " Do you have any questions ?   ", "id": 3, "page": "19_IN16"},
{"q": " Experience from past job.   ", "id": 4, "page": "19_IN16"},
{"q": " How did you handle certain situations?   ", "id": 5, "page": "19_IN16"},
{"q": " Toughest decision made?   ", "id": 6, "page": "19_IN16"},
{"q": " What do you expect from Accenture?   ", "id": 7, "page": "19_IN16"},
{"q": " Why would you like to join accenture?   ", "id": 8, "page": "19_IN16"},
{"q": " Case studies regarding insurance clients.   ", "id": 9, "page": "19_IN16"},
{"q": " Should Accenture advise client to use a passenger aircraft for storing golf balls - Yes or No with reasons?   ", "id": 10, "page": "19_IN16"},
{"q": " Give me an example of a time where you had a tough stakeholder to deal with.   ", "id": 11, "page": "19_IN16"},
{"q": " - Introduce yourself.", "id": 12, "page": "19_IN16"},
{"q": "- Why are you interested in CFM?", "id": 13, "page": "19_IN16"},
{"q": "* That's all! Literally! I took the initiative to speak up to introduce my background, otherwise, the interview would have lasted for only 5 minutes. Could you please take candidates more seriously?   ", "id": 14, "page": "19_IN16"},
{"q": " Why Accenture?   ", "id": 15, "page": "19_IN16"},
{"q": " Some security related questions   ", "id": 16, "page": "19_IN16_IP2"},
{"q": " No real unexpected questions   ", "id": 17, "page": "19_IN16_IP2"},
{"q": " Tell me about a challenge and how you overcame it   ", "id": 18, "page": "19_IN16_IP2"},
{"q": " What makes you unique   ", "id": 19, "page": "19_IN16_IP2"},
{"q": " Most difficult for me would've been the case study. I didn't mention the case study above was because I think I'll mention it here. The case study was regarding a bank and how Accenture can help this bank, there were about 10-15 pages of information to digest and we had a time limit to present it. It was a lot of information and data, like the companies objectives, the growth in the banking industry, what is happening in the market. The information is definitely not Australia, could be fictional could be some other country. Be aware that not all the information provided is useful, some are there to trick you, so if you don't use all of it its ok. We had to present it to managers and it was quite stressful. The feedback we got was that we gave solutions to help the bank but we didn't really mention how it would help the bank. Also a question I didn't expect was, \"So you have presented us a solution, what's next?\" I didn't really know what the next step was and we were kinda stuck at that.   ", "id": 20, "page": "19_IN16_IP2"},
{"q": " tell me something you learned from school   ", "id": 21, "page": "19_IN16_IP2"},
{"q": " What makes a good consultant?   ", "id": 22, "page": "19_IN16_IP2"},
{"q": " The questions were fairly straight forward - the hardest question was probably along the lines of \"a client has come to you asking for a Request for Proposal (RFP) for a project they want to undertake...how would you go about putting this together?\"   ", "id": 23, "page": "19_IN16_IP2"},
{"q": " How do you see yourself fit into the company? What can you bring?   ", "id": 24, "page": "19_IN16_IP2"},
{"q": " What makes you want to work for Accenture?   ", "id": 25, "page": "19_IN16_IP3"},
{"q": " Your perspective of Accenture and how they conduct business.   ", "id": 26, "page": "19_IN16_IP3"},
{"q": " What do you know about Accenture and where do you see yourself within?", "id": 27, "page": "19_IN16_IP3"},
{"q": "Describe a time you have failed.", "id": 28, "page": "19_IN16_IP3"},
{"q": "When have you had to develop and work as part of a team?", "id": 29, "page": "19_IN16_IP3"},
{"q": "Where do you see yourself in short, medium and distant future?   ", "id": 30, "page": "19_IN16_IP3"},
{"q": " Q: Tell me about yourself?   ", "id": 31, "page": "19_IN16_IP3"},
{"q": " Why do you want to work at Accenture?   ", "id": 32, "page": "19_IN16_IP3"},
{"q": " Explain how you resolved an issue during project you have worked on that didn't go as expected   ", "id": 33, "page": "19_IN16_IP3"},
{"q": " no handbook. all vary per interviewers and practice line applying into.   ", "id": 34, "page": "19_IN16_IP3"},
{"q": " No difficult questions as behavioural interviewing method not really used.", "id": 35, "page": "19_IN16_IP3"},
{"q": "Cases weren't difficult, although partner expected considerable finesse in case study method rather than excellence in business insight.", "id": 36, "page": "19_IN16_IP3"},
{"q": "Considerable annoyance at proceeding to offer then withdrawing due to hiring freezes, especially following a confusing recruitment process.", "id": 37, "page": "19_IN16_IP3"},
{"q": "HR very good at trying to keep me interested in joining subject to changing business conditions for 6 months thereafter, but the managing partner that this role supposedly was his 2IC, couldn't have cared less - returned no calls, emails and didn't deliver on any promises.", "id": 38, "page": "19_IN16_IP3"},
{"q": "On following up (again) this year everyone at Accenture had lost interest. Given this was a 10 month process, this shows that Accenture are a difficult and confusing company to interview for, who don't appear to know what they're doing (marketing promoting referral entry points when demand is slowing,convoluted interviewing processes made-up-as-they-went where 7 interviews were required), really string you along and waste your time.   ", "id": 39, "page": "19_IN16_IP3"},
{"q": " What was one situation in a past project you wish you had handled differently?   ", "id": 40, "page": "19_IN16_IP3"},
{"q": " What is your biggest challenge?   ", "id": 41, "page": "19_IN16_IP3"},
{"q": " Tell me about a time when you had to do something you hadn't done before.   ", "id": 42, "page": "19_IN16_IP4"},
{"q": " What unique area are you a subject matter expert in that we could use to sell to clients   ", "id": 43, "page": "19_IN16_IP4"},
{"q": " Tell me about what you did with emphasis on how you did it (with examples in very high details)   ", "id": 44, "page": "19_IN16_IP4"},
{"q": " Can you take me through in detail how you managed to setup a fully functioning retail website and the supporting eCommerce operations in less than 6 months?   ", "id": 45, "page": "19_IN16_IP4"},
{"q": " Behavioural interview:", "id": 46, "page": "19_IN16_IP4"},
{"q": "Tell me about a time when you collaborated with others.", "id": 47, "page": "19_IN16_IP4"},
{"q": "Tell me about a challenge and how you overcame it.", "id": 48, "page": "19_IN16_IP4"},
{"q": "Tell me of a time you have been unsuccessful at your job.   ", "id": 49, "page": "19_IN16_IP4"},
{"q": " Was asked about Vram and few scenario based questions. Which I think were not that difficult to answer.   ", "id": 50, "page": "19_IN16_IP4"},
{"q": " Will go through your resume and ask about previous work ex?   ", "id": 51, "page": "19_IN16_IP4"},
{"q": " What impressed me most about the many interview questions (which I enjoyed answering) was that they were very scenario-driven and behavioural, which I believe helped the interviewers understand my skills at a deeper level.", "id": 52, "page": "19_IN16_IP4"},
{"q": "Eg. Describe a time when you were faced with a difficult challenge and how did you handle it   ", "id": 53, "page": "19_IN16_IP4"},
{"q": " What is your career goal?   ", "id": 54, "page": "19_IN16_IP4"},
{"q": " Why would someone with your resume want to work at this level?   ", "id": 55, "page": "19_IN16_IP4"},
{"q": " I can't remember any of the questions from the interview   ", "id": 56, "page": "19_IN16_IP5"},
{"q": " Describe a situation where you had to convince your manager with one of your ideas.   ", "id": 57, "page": "19_IN16_IP5"},
{"q": " Describe a situation where you had a conflict at your workplace and how you managed it.   ", "id": 58, "page": "19_IN16_IP5"},
{"q": " Why do you want to join Accenture? What do you know about the organisational structure at Accenture?   ", "id": 59, "page": "19_IN16_IP5"},
{"q": " Describe a typical day of a Consultant @ Accenture.   ", "id": 60, "page": "19_IN16_IP5"},
{"q": " What can we do to sell you on Accenture?", "id": 61, "page": "19_IN16_IP5"},
{"q": "and", "id": 62, "page": "19_IN16_IP5"},
{"q": "How do you deal with a difficult client?   ", "id": 63, "page": "19_IN16_IP5"},
{"q": " Questions about why I want to work at Accenture and whether I am able to cope with their environment and culture.   ", "id": 64, "page": "19_IN16_IP5"},
{"q": " What do you know about Accenture - where (in terms of business group and technology streams) do you see yourself fitting in   ", "id": 65, "page": "19_IN16_IP5"},
{"q": " How do you we are the right company for you and that you are right for us?   ", "id": 66, "page": "19_IN16_IP5"},
{"q": " What is your leadership style?   ", "id": 67, "page": "19_IN16_IP5"},
{"q": " What do you see yourself doing day-to-day.   ", "id": 68, "page": "19_IN16_IP5"},
{"q": " What do you like about Accenture?   ", "id": 69, "page": "19_IN16_IP5"},
{"q": " Why Accenture over other companies?   ", "id": 70, "page": "19_IN16_IP5"},
{"q": " What do you know about Accenture - where (in terms of business group and technology streams) do you see yourself fitting in   ", "id": 71, "page": "19_IN16_IP5"},
{"q": " Describe in detail your [honours/masters/major works] at uni including any aspects of group work   ", "id": 72, "page": "19_IN16_IP5"},
{"q": " The most unexpected question was asking me to explain my reasoning for choosing my leaving certificate subjects   ", "id": 73, "page": "19_IN16_IP5"},
{"q": " - Senior Manager interview was the hardest   ", "id": 74, "page": "19_IN16_IP5"},
{"q": " Group case study presentation.   ", "id": 75, "page": "19_IN16_IP6"},
{"q": " What is your favourite subject?   ", "id": 76, "page": "19_IN16_IP6"},
{"q": " Tell me about your achievements during your study?   ", "id": 77, "page": "19_IN16_IP6"},
{"q": " In the past, how did you feel you had improved a process?   ", "id": 78, "page": "19_IN16_IP6"},
{"q": " Tell me about a time you have pioneered innovation.   ", "id": 79, "page": "19_IN16_IP6"},
{"q": " Behavioral questions-prepare well for these   ", "id": 80, "page": "19_IN16_IP6"},
{"q": " Why do you want to work for Accenture?   ", "id": 81, "page": "19_IN16_IP6"},
{"q": " Are you comfortable speaking in front of people   ", "id": 82, "page": "19_IN16_IP6"},
{"q": " How are you going to use your degree and provide a new solution to our clients.   ", "id": 83, "page": "19_IN16_IP6"},
{"q": " What do you hope to do in 5 or 10 years?   ", "id": 84, "page": "19_IN16_IP6"},
{"q": " Tell us about yourself; what's your key strength.   ", "id": 85, "page": "19_IN16_IP7"},
{"q": " Just some of the self reflecting questions   ", "id": 86, "page": "19_IN16_IP7"},
{"q": " How many bowling balls can I fit into a private jet.   ", "id": 87, "page": "19_IN16_IP7"},
{"q": " Tell me about a situation where you had to make a hard decision?   ", "id": 88, "page": "19_IN16_IP7"},
{"q": " Give an example of a situation where you were required to deal with a difficult client   ", "id": 89, "page": "19_IN16_IP7"},
{"q": " The Questions were common behavioral questions focusing on your experiences and achievements as a student.,   ", "id": 90, "page": "19_IN16_IP7"},
{"q": " What is your plan for the next three to five years?   ", "id": 91, "page": "19_IN16_IP7"},
{"q": " what is your goal in 5 years?   ", "id": 92, "page": "19_IN16_IP7"},
{"q": " The questions were not probing and they were nothing out of the ordinary either, like how did you build an HR strategy to suit the business strategy, did you take an unpopular stand on what was important for the business, did you handle any critical employee relation issues, etc.,   ", "id": 93, "page": "19_IN16_IP7"},
{"q": " I didn't find the questions difficult because I have ready answers for them.   ", "id": 94, "page": "19_IN16_IP7"},
{"q": " Describe a situation where you had a conflict with your teammate and how did you resolve it   ", "id": 95, "page": "19_IN16_IP8"},
{"q": " Tell me about a difficult project you worked on and how did you go about it resolving it.   ", "id": 96, "page": "19_IN16_IP8"},
{"q": " Describe a time or situation in the past where you have had to make a difficult decision and what was the outcome.   ", "id": 97, "page": "19_IN16_IP8"},
{"q": " Describe a recent difficult situation and how you handled it.   ", "id": 98, "page": "19_IN16_IP8"},
{"q": " Tell me about a time when you collaborated with others.   ", "id": 99, "page": "19_IN16_IP8"},
{"q": " Case Study, Aptitude Questions, Behavioral Interview Questions, Background, Experience   ", "id": 100, "page": "19_IN16_IP8"},
{"q": " Describe a difficult situation in your previous experience, and what you did?   ", "id": 101, "page": "19_IN16_IP8"},
{"q": " Tell me of a time you have been unsuccessful at your job   ", "id": 102, "page": "19_IN16_IP8"},
{"q": " Where do you see yourself in the future?   ", "id": 103, "page": "19_IN16_IP8"},
{"q": " Tell me about a time when your view on something has been different to your managers and how did you go about convincing your manager your view was the correct one?   ", "id": 104, "page": "19_IN16_IP8"},
{"q": " Tell me about a time when you were confronted by extremely tight deadlines.   ", "id": 105, "page": "19_IN16_IP8"},
{"q": " Business case   ", "id": 106, "page": "19_IN16_IP8"},
{"q": " A lot of questions were scenario-based ones so it pays to be prepared.   ", "id": 107, "page": "19_IN16_IP9"},
{"q": " MANAGER DID NOT SHOW UP FOR INTERVIEW 2 TIMES......   ", "id": 108, "page": "19_IN16_IP9"},
{"q": " Stock Standard behavioral questions   ", "id": 109, "page": "19_IN16_IP9"},
{"q": " Do you know 6 Sigma?   ", "id": 110, "page": "19_IN16_IP9"},
{"q": " Tell me a situation when you had a disagreement with your team. What did you do?   ", "id": 111, "page": "19_IN16_IP9"},
{"q": " What do you see as the next stage of the FS industry and how will their profits evolve over the next few years. What can possibly be the SWOT for this?   ", "id": 112, "page": "19_IN16_IP9"},
{"q": " Technical Interview (in depth question related to skillset)", "id": 113, "page": "19_IN16_IP9"},
{"q": "    Programming skills", "id": 114, "page": "19_IN16_IP9"},
{"q": "    Databases", "id": 115, "page": "19_IN16_IP9"},
{"q": "    SQL   ", "id": 116, "page": "19_IN16_IP9"},
{"q": " Questions were centred on situations   ", "id": 117, "page": "19_IN16_IP9"},
{"q": " Very detailed question with previous work experience in the behavioural interview, how you deal with conflict with colleague   ", "id": 118, "page": "19_IN16_IP9"},
{"q": " How do you manage conflict..   ", "id": 119, "page": "19_IN16_IP9"},
{"q": " Detailed scenario based ques in behavioral round. Google them. They are meant to test your mind and personality. How you perform. How you think. Your conference.   ", "id": 120, "page": "19_IN16_IP10"},
{"q": " How did you manage the difficult situation? What was the most challenging situation at work place and how did you handle it?   ", "id": 121, "page": "19_IN16_IP10"},
{"q": " Market Sizing case study   ", "id": 122, "page": "19_IN16_IP10"},
{"q": " How did you deal with problems with developers? Wanted specific examples.   ", "id": 123, "page": "19_IN16_IP10"},
{"q": " Past experience was unrelated, so was asked about how it applied to the role. Behavioural questions looked at project management, dealing with tough situations, mentoring a colleague and initiating a project. The MD asked me to justify my existence in his team, what I \"brought to the table\".   ", "id": 124, "page": "19_IN16_IP10"},
{"q": " Tell me about a time when you dealt with a difficult client.   ", "id": 125, "page": "19_IN16_IP10"},
{"q": " They asked me some detailed questions about consulting, which I did not expect. e.g. What is consulting. Which is the most difficult part of consulting? Describe a day-to-day consulting work.   ", "id": 126, "page": "19_IN16_IP10"},
{"q": " Who are our competitors?   ", "id": 127, "page": "19_IN16_IP10"},
{"q": " N/A - questions were stock standard and behavioural questions can be prepared for.   ", "id": 128, "page": "19_IN16_IP10"},
{"q": " What is a challenge you were able to overcome and what would you do next time to improve?   ", "id": 129, "page": "19_IN16_IP10"},
{"q": " The most difficult thing was the preparation time for the case study interview, remember to scan through as much information as you can.   ", "id": 130, "page": "19_IN16_IP11"},
{"q": " I would recommend going into any interviews with a firm understanding of Accenture; including their services, company values and stance in market. They will want to know what has drawn you to consider a career at Accenture and this will be consistent at each stage of the interview process. Part of one of the interview stages is a behavioural assessment - they will ask questions on likely work scenarios so best to answer as honestly as possible. I would advise refreshing on instances you would likely deal with in the role you are interviewing for and make sure you have all details front of mind.   ", "id": 131, "page": "19_IN16_IP11"},
{"q": " they were all basic behavioural questions and what would you do in this/tha situation questions   ", "id": 132, "page": "19_IN16_IP11"},
{"q": " usual consulting interview. solve a case, behavioral quesitons   ", "id": 133, "page": "19_IN16_IP11"},
{"q": " How do you deal with uncertainty?   ", "id": 134, "page": "19_IN16_IP11"},
{"q": " What attracts you to the role?   ", "id": 135, "page": "19_IN16_IP11"},
{"q": " What interests you about this role?", "id": 136, "page": "19_IN16_IP11"},
{"q": "Do you have batch scripting experience?   ", "id": 137, "page": "19_IN16_IP11"},
{"q": " Tell us about yourself.", "id": 138, "page": "19_IN16_IP11"},
{"q": "Behaviour questions about teamwork and leadership.   ", "id": 139, "page": "19_IN16_IP11"},
{"q": " In physical interview: Case interview, standard personality tests - they prod for things you exemplify that fit their values (stewardship etc.) - hone down on these and you'll be fine.   ", "id": 140, "page": "19_IN16_IP11"},
{"q": " Tell me about a time where you have demonstrated perseverance   ", "id": 141, "page": "19_IN16_IP11"},
{"q": " Questions weren't curve balls, as far as I remember. They revolved a lot around team work, autonomy, having persistence, thinking outside the box, leadership, risk, noticing failures early. Nothing you won't find on the internet. Stay confident and smile always, and you should be fine. Yes there may be instances where the Manager/GM may put you in a spot you aren't comfortable i.e ask something like, \"tell me what's the latest news you read about technology\" - you need to respond according to the job and make sure you let the interviewer know the latest news and are aware of whats happening in the industry. Also, know a fair bit about the firm ( needless to say, but still )   ", "id": 142, "page": "19_IN16_IP12"},
{"q": " Why Accenture?", "id": 143, "page": "19_IN16_IP12"},
{"q": "Why Consultant?", "id": 144, "page": "19_IN16_IP12"},
{"q": "Why did you choose your discipline in University?   ", "id": 145, "page": "19_IN16_IP12"},
{"q": " How much you know about the role?   ", "id": 146, "page": "19_IN16_IP12"},
{"q": " Where do you see yourself in 5 years?   ", "id": 147, "page": "19_IN16_IP12"},
{"q": " Why do you want the role?   ", "id": 148, "page": "19_IN16_IP12"},
{"q": " previous experiences   ", "id": 149, "page": "19_IN16_IP12"},
{"q": " Tell me how did you landed for this job   ", "id": 150, "page": "19_IN16_IP12"},
{"q": " Tell me about your yourself, past experiences handling critical project   ", "id": 151, "page": "19_IN16_IP12"},
{"q": " How to avoid difficult time and conflicts in team   ", "id": 152, "page": "19_IN16_IP12"},
{"q": " There wasn't a formal interview, you were just pulled aside to chat casually to a managing director. It was mostly about what your interests are and what you would like to do.   ", "id": 153, "page": "19_IN16_IP12"},
{"q": " What was a past experience where you had to work in a team? What were the difficulties?   ", "id": 154, "page": "19_IN16_IP12"},
{"q": " Some work scenerio questions   ", "id": 155, "page": "19_IN16_IP12"},
{"q": " tell about your experience   ", "id": 156, "page": "19_IN16_IP13"},
{"q": " Why do you want to join Accenture?   ", "id": 157, "page": "19_IN16_IP13"},
{"q": " Talk about innovative technology.   ", "id": 158, "page": "19_IN16_IP13"},
{"q": " Video interview: Tell me about yourself and what do you know about Accenture?", "id": 159, "page": "19_IN16_IP13"},
{"q": "Face to face: Why consulting? What do you know about consulting?   ", "id": 160, "page": "19_IN16_IP13"},
{"q": " Tell us about yourself   ", "id": 161, "page": "19_IN16_IP13"},
{"q": " First interview asked for the general questions. Technical interview basically covered the SAP Hana and ECC differences and improvements. In MD's interview he just told to ask any question from him.   ", "id": 162, "page": "19_IN16_IP13"},
{"q": " Pymetrics.com 12 game-like questions   ", "id": 163, "page": "19_IN16_IP13"},
{"q": " Asking about integration experience. CI/CD.. Agile.. webMethods.. Java... Then achievements you ever had in your technical journey   ", "id": 164, "page": "19_IN16_IP13"},
{"q": " History, processes followed, project planning, testing scenarios   ", "id": 165, "page": "19_IN16_IP13"}
]