[
{"q": " What's is heap?", "id": 1, "page": "16_IN16_IP3"},
{"q": "What kinds of algorithm are normally used in heap?", "id": 2, "page": "16_IN16_IP3"},
{"q": "The application of heap.   ", "id": 3, "page": "16_IN16_IP3"},
{"q": " How would you rate yourself on the following, 1 was know nothing, 10 was expert level.   ", "id": 4, "page": "16_IN16_IP3"},
{"q": " Code question about tree structures, implementations   ", "id": 5, "page": "16_IN16_IP3"},
{"q": " I cannot tell the details.", "id": 6, "page": "16_IN16_IP3"},
{"q": "it is about string manipulation and parsing.   ", "id": 7, "page": "16_IN16_IP3"},
{"q": " A sample code to review and find if there is any problem?", "id": 8, "page": "16_IN16_IP3"},
{"q": "An algorithm to solve.", "id": 9, "page": "16_IN16_IP3"},
{"q": "Question about OOP concepts.   ", "id": 10, "page": "16_IN16_IP3"},
{"q": " Count the number of trigrams in a sentence.   ", "id": 11, "page": "16_IN16_IP3"},
{"q": " Make a function that has a chance to select a particular trigram dependent upon how frequently it appears in a sentence. (So if you have abc which appears 2 times and dog that appears once, then abc should be selected 2/3 of the time)   ", "id": 12, "page": "16_IN16_IP3"},
{"q": " Make a regex for ip addresses   ", "id": 13, "page": "16_IN16_IP3"},
{"q": " Variation of binary search   ", "id": 14, "page": "16_IN16_IP3"},
{"q": " Given an array of integers, return an array consisting of the product of N-1 elements.   ", "id": 15, "page": "16_IN16_IP3"},
{"q": " Match arrangement   ", "id": 16, "page": "16_IN16_IP2"},
{"q": " Merge sort best/worst runtimes.", "id": 17, "page": "16_IN16_IP3"},
{"q": "Data structure behind map in particular language.", "id": 18, "page": "16_IN16_IP3"},
{"q": "Use case for heaps.   ", "id": 19, "page": "16_IN16_IP3"},
{"q": " What happens in Linux Shell when trying to run ls command, Describe TCP protocol, how is TCP different from UDP and when to use each one, DNS uses UDP or TCP protocol, What is the size of UDP packet, Describe what is a struct, enum and union in C, describe the memory structure on the operating system (heap,data and stack)   ", "id": 20, "page": "16_IN16_IP8"},
{"q": " Write a method that takes in a word and a timestamp, output the word if it hasn't already been output in the last 10 seconds   ", "id": 21, "page": "16_IN16_IP2"},
{"q": " I had to do lots of calculations to estimate memory usage/ speeds for a large distributed system (can't give anymore details due to Google's interview questions being considered intellectual property that is confidential)   ", "id": 22, "page": "16_IN16_IP2"},
{"q": " An unexpected operation on a nominated data structure -- the particulars would be different for each candidate.   ", "id": 23, "page": "16_IN16_IP2"},
{"q": " Out of the respect for the NDA I would not be able to share the exact details of the questions but two of the questions involved DFS on a 2d matrix. 1 question was on string manipulation and one was about solving a problem related to google docs.   ", "id": 24, "page": "16_IN16_IP2"},
{"q": " related to double array   ", "id": 25, "page": "16_IN16_IP2"},
{"q": " Under NDA, but programming questions covered string processing, graph traversal and AI.   ", "id": 26, "page": "16_IN16_IP2"},
{"q": " abstract version: given array of doubles representing left start position of lines with width 0.01 meter like [-0.001, 0.001,0.01, -0.2] along x axis determine if the give lines cover [0.0 ,1.0] inclusive   ", "id": 27, "page": "16_IN16_IP2"},
{"q": " How big was the systems I worked with?   ", "id": 28, "page": "16_IN16_IP2"},
{"q": " problem solving   ", "id": 29, "page": "16_IN16_IP2"},
{"q": " Write a recursive function to calculate pascal's pyramid numbers. (Actually easy).", "id": 30, "page": "16_IN16_IP5"},
{"q": " What is your proudest moment?   ", "id": 31, "page": "16_IN16_IP7"},
{"q": " Common problems you could prepare using LeetCode and Cracking Coding Interview, etc.   ", "id": 32, "page": "16_IN16_IP4"},
{"q": " No surprise questions, I expected most behavioural questions. The cases made the most difference.   ", "id": 33, "page": "16_IN16_IP8"},
{"q": " Why are you interested in google?   ", "id": 34, "page": "16_IN16_IP8"},
{"q": " Lots of past experience questions, e.g. Describe a time when you did x.   ", "id": 35, "page": "16_IN16_IP8"},
{"q": " Something on the \"awk\" command arguments   ", "id": 36, "page": "16_IN16_IP8"},
{"q": " What do you think was the strategy behind introducing Google Pixel?   ", "id": 37, "page": "16_IN16_IP8"},
{"q": " If you were working for Facebook, how would you convert SMB to use adverts? What would you do with a 10 million GBP budget for the year   ", "id": 38, "page": "16_IN16_IP8"},
{"q": " Give me your go-to-market strategy for Google Home. Include customer acquisition (target market) and campaign details   ", "id": 39, "page": "16_IN16_IP8"},
{"q": " If you were working for a company using email marketing only, what would be your strategy to acquire new customers.   ", "id": 40, "page": "16_IN16_IP8"},
{"q": " what is the worst case of quicksort   ", "id": 41, "page": "16_IN16_IP8"},
{"q": " Interval scheduling, print missing numbers in an array   ", "id": 42, "page": "16_IN16_IP8"},
{"q": " If you had to replace every light-bulb in the UK, how would you calculate how many light-bulbs you would need?   ", "id": 43, "page": "16_IN16_IP8"},
{"q": " Transmute one word to another by the shortest path of 1-letter changes through a path of actual words.   ", "id": 44, "page": "16_IN16_IP8"},
{"q": " Find all files with the same file data and link them up.   ", "id": 45, "page": "16_IN16_IP8"},
{"q": " Find the longest subsequence of duplicate numbers in an array of sorted numbers.   ", "id": 46, "page": "16_IN16"},
{"q": " Design an ad campaign/allocate advertising spend to promote a car designed to target middle age females   ", "id": 47, "page": "16_IN16_IP6"},
{"q": "Also open-ended knowledge questions.   ", "id": 48, "page": "16_IN16_IP5"},
{"q": " Estimate the storage usage of GMail.   ", "id": 49, "page": "16_IN16_IP5"},
{"q": " Implement a hashmap   ", "id": 50, "page": "16_IN16_IP5"},
{"q": " A magic square algorithm.   ", "id": 51, "page": "16_IN16_IP5"},
{"q": " Given a list of pairs of adjacencies for a tree, construct the tree.   ", "id": 52, "page": "16_IN16_IP5"},
{"q": " brain teasers and some basic algorithm questions.   ", "id": 53, "page": "16_IN16_IP5"},
{"q": " given a list of pairs (parent, child) navigate the list of pairs and fill the supplied data structure:", "id": 54, "page": "16_IN16_IP5"},
{"q": "class Entry{", "id": 55, "page": "16_IN16_IP5"},
{"q": "    String data;", "id": 56, "page": "16_IN16_IP5"},
{"q": "    Set<Entry> Children", "id": 57, "page": "16_IN16_IP5"},
{"q": "}", "id": 58, "page": "16_IN16_IP5"},
{"q": "EG: { (A,B), (A,C), (A,D), (B,E), (E,F) }   ", "id": 59, "page": "16_IN16_IP5"},
{"q": " Mostly data structure questions.   ", "id": 60, "page": "16_IN16_IP5"},
{"q": " During the first call, I was prompted at first with very basic questions about operating system and networking, then in went deeper on questions like: \"what happen if you type telnet www.google.com\", the questions within this one ranged from \"tell me the process uses the OS to create that connection\" to \"how the data travels through the internet to reach the target server\".", "id": 61, "page": "16_IN16_IP5"},
{"q": "The second call went even deeper in troubleshooting Linux, web servers, dns, load balancing, IP, routing and so on. Also, the recruiter asked me to code some python and bash scripts in order to solve some problems made for that interview   ", "id": 62, "page": "16_IN16_IP5"},
{"q": " Basic CTCI style questions - mostly around data structures", "id": 63, "page": "16_IN16_IP5"},
{"q": "System design question with lots of maths and 'numbers everyone computer scientist should know'   ", "id": 64, "page": "16_IN16_IP5"},
{"q": " Although in essence, this is a engineering role, but they did ask a lot about the sales which could be challenge to answer. However, they did ask any tricky questions for this role. So my suggestion is to focus on the responsibilities of this role if you proceed to the onsite interview stage   ", "id": 65, "page": "16_IN16_IP7"},
{"q": " What would you say to a CEO of a company who is considering to use AWS in order to convince him to use GCP?   ", "id": 66, "page": "16_IN16_IP7"},
{"q": " Differentiators of GCP?   ", "id": 67, "page": "16_IN16_IP7"},
{"q": " What do you know about G Suite?   ", "id": 68, "page": "16_IN16_IP7"},
{"q": " What would be your advice for Google if they are considering to build a new data centre, whether to build or to lease?   ", "id": 69, "page": "16_IN16_IP7"},
{"q": " Hyperthetical questions: how to increase trial clients to paid clients?   ", "id": 70, "page": "16_IN16_IP7"},
{"q": " The project you have recently done, the problem you have come across and how you solve it.   ", "id": 71, "page": "16_IN16_IP7"},
{"q": " Technical skill is a must for this role. You're leading a team of dev's and you have to be able to not just keep up on a technical level but you need to be out ahead of them in terms of vision and to do that you need to have the technical base. Even though I have a Software Dev. degree, the fact that I hadn't worked in the field in a technical capacity meant that I ended up pulling out of the process once I understood the detail because I don't have the technical chops. Credit to Google for looking at me in the first place and for making it a pleasant process even though I didn't get there...   ", "id": 72, "page": "16_IN16_IP7"},
{"q": " What color do you think in?   ", "id": 73, "page": "16_IN16_IP7"},
{"q": " what is the most important lesson in your previous work   ", "id": 74, "page": "16_IN16_IP7"},
{"q": " Name a competitor to Google who failed in the market.", "id": 75, "page": "16_IN16_IP7"},
{"q": "What would you have done differently to succeed.   ", "id": 76, "page": "16_IN16_IP7"},
{"q": " Your product owner has come to you asking to test a confidential prototype in 24 hours. What do you do?   ", "id": 77, "page": "16_IN16_IP7"},
{"q": " What kind of influence do have over local media contacts?   ", "id": 78, "page": "16_IN16_IP7"},
{"q": " I don't want to leak any interview questions; but the general content of questions Google asks is no big secret. I can categorically state that there are NO stupid brain-teaser \"You are shrunk to the size of a quarter\" type questions at all. The questions all involve coding an algorithm. I suggest that everyone considering applying for a technical role at Google read Steve Yegge's (public) blog post about it. All you need is in there: http://steve-yegge.blogspot.com.au/2008/03/get-that-job-at-google.html   ", "id": 79, "page": "16_IN16_IP4"},
{"q": " Questions about time complexity, sorting, worst case...   ", "id": 80, "page": "16_IN16_IP4"},
{"q": " Unexpected to answer so many technical questions on the spot.   ", "id": 81, "page": "16_IN16_IP4"},
{"q": " How to implement a queue simply using two stacks and how to implement a highly efficient queue using two stacks.   ", "id": 82, "page": "16_IN16_IP4"},
{"q": " Calculating the max execution time of a program that had to fit into a certain size of memory on an embedded device.   ", "id": 83, "page": "16_IN16_IP4"},
{"q": " How to know and remove duplicate nodes from a graph?   ", "id": 84, "page": "16_IN16_IP4"},
{"q": " Large data set, in memory sorting with limited RAM   ", "id": 85, "page": "16_IN16_IP4"},
{"q": " Have you experience of inside sales?   ", "id": 86, "page": "16_IN16_IP4"},
{"q": " Questions about my project experiences.   ", "id": 87, "page": "16_IN16_IP4"},
{"q": " Increment a number inside a string.", "id": 88, "page": "16_IN16_IP4"},
{"q": "Implement Conway's Game of Life.", "id": 89, "page": "16_IN16_IP4"},
{"q": "Find the largest substring of a string that occurs more than once (occurrences can be overlapping - ie f(\"Banana\") = \"ana\")   ", "id": 90, "page": "16_IN16_IP4"},
{"q": " Code a hashmap which you would be happy to place into a production environment.   ", "id": 91, "page": "16_IN16"},
{"q": " There are n integers in disk. Memory has m space. how to sort the data efficiently.   ", "id": 92, "page": "16_IN16"},
{"q": " Reverse the bits in a 32 bit integer. Write C code for that.   ", "id": 93, "page": "16_IN16"},
{"q": " Non programming. The mouse in the maze problem. Shortest paths to reach outside.   ", "id": 94, "page": "16_IN16"},
{"q": " Given a web system which gets disconnected, how would you debug it. Also where would you add resources to maximise throughput given some constraints.   ", "id": 95, "page": "16_IN16"},
{"q": " Given a statement which took an integer, incremented it by 1 and then branched to another location which you provide, implement addition of two numbers multiplication, etc using just that statement (or command).   ", "id": 96, "page": "16_IN16"},
{"q": " C++ versus Java.", "id": 97, "page": "16_IN16"},
{"q": "Reverse a singly lined list.   ", "id": 98, "page": "16_IN16"},
{"q": " How to add a counter to www.google.com to track the billionth user.   ", "id": 99, "page": "16_IN16"},
{"q": " You have a 64bit interger counter set to 0. How long it will take to overflow the counter given that you are incrementing it at 4Ghz speed.   ", "id": 100, "page": "16_IN16"},
{"q": " Comparisons of trees and hash tables.", "id": 101, "page": "16_IN16"},
{"q": "What are the tradeoffs of using one versus another.   ", "id": 102, "page": "16_IN16"},
{"q": " Quickly estimate 2^64 without using a pen/papar.   ", "id": 103, "page": "16_IN16"},
{"q": " Estimate the total storage size of GMAIL   ", "id": 104, "page": "16_IN16"},
{"q": " Suppose that you earn 100% annual interest (APY) on $1 initial deposit. How long before you'll be as rich as Bill Gates ($63 billion)?", "id": 105, "page": "16_IN16"},
{"q": "Given a number, e.g., 314159, as an array [3,1,4,1,5,9], increment it: change it to [3,1,4,1,6,0].   ", "id": 106, "page": "16_IN16"},
{"q": " how many golf balls could you fit into that building?   ", "id": 107, "page": "16_IN16"},
{"q": " How long will it take for an unsigned 64 bit counter to overflow on a xxx ghz machine and another coding problem that requires recursive programming.   ", "id": 108, "page": "16_IN16_IP6"},
{"q": " Fix the health of the internet   ", "id": 109, "page": "16_IN16_IP6"},
{"q": " How can you efficiently transfer a large number of files from a Unix server to another one?   ", "id": 110, "page": "16_IN16_IP6"},
{"q": " If Google happened to forget to train, or induct 15% of the company, what would you do to rectify this, or get to the bottom of why this happened? (found out that this is a real life example!!!)   ", "id": 111, "page": "16_IN16_IP6"},
{"q": " Question about graph and traverse.   ", "id": 112, "page": "16_IN16_IP6"},
{"q": " Given an array of millions of floating point numbers, find the number of triplets that are equal to or less than another floating point number.", "id": 113, "page": "16_IN16_IP6"},
{"q": "I.e write the function countTriplets(double[] numbers, double sum);   ", "id": 114, "page": "16_IN16_IP6"},
{"q": " What happens when you type www.google.com into the address bar of your browser and press enter?   ", "id": 115, "page": "16_IN16_IP6"},
{"q": " Define how search keyword suggestion (such as the suggestions in google search) can be implemented.   ", "id": 116, "page": "16_IN16_IP6"},
{"q": " Why I wanted to work at Google.   ", "id": 117, "page": "16_IN16_IP6"},
{"q": " How to do a level-order-traversal   ", "id": 118, "page": "16_IN16_IP10"},
{"q": " Give an example of dealing with a conflict with management and how you handled it   ", "id": 119, "page": "16_IN16_IP10"},
{"q": " Describe your work experience in 3 to 4 minutes   ", "id": 120, "page": "16_IN16_IP10"},
{"q": " Do you know about Product Management at Google   ", "id": 121, "page": "16_IN16_IP10"},
{"q": " Have you managed a product from conception to release?   ", "id": 122, "page": "16_IN16_IP10"},
{"q": " Q: What is a time where you have had to make a critical decision?   ", "id": 123, "page": "16_IN16_IP9"},
{"q": " Q: What would you improve about Google/.   ", "id": 124, "page": "16_IN16_IP9"},
{"q": " Finance director could not access gmail or other websites. Using Windows 7. Wifi shows bars but has \"!\" symbol.   ", "id": 125, "page": "16_IN16_IP9"},
{"q": " Employee would like to know how he can stop snoopers from accessing his wifi.   ", "id": 126, "page": "16_IN16_IP9"},
{"q": " There are a group of people standing in a circle all evenly spaced. How many people are there in the circle if person 6 and 18 are standing directly opposite to each other?   ", "id": 127, "page": "16_IN16_IP9"},
{"q": " How can you quickly approximate 2^24   ", "id": 128, "page": "16_IN16_IP9"},
{"q": " How would you increase YouTube's revenue by 100%?   ", "id": 129, "page": "16_IN16_IP9"},
{"q": " Some of the questions were about:", "id": 130, "page": "16_IN16_IP9"},
{"q": "Dhcp - network problem, one person in the wan of about 200 computers cannot access the internet, how would you go about solving this problem. Problem was expanded on, after suggesting using ipconfig and static ip.", "id": 131, "page": "16_IN16_IP9"},
{"q": "Dns - what is the process of dns and if the isp doesn't have the look up table how does it discover the address of the site.", "id": 132, "page": "16_IN16_IP9"},
{"q": "Dead laptop, what would be the process of approaching such a situation.", "id": 133, "page": "16_IN16_IP9"},
{"q": "Blue screen of death - how would go about fixing a problem with the blue screen in windows, what are some tools you can suggest the user use.", "id": 134, "page": "16_IN16_IP9"},
{"q": "Registry - what is registry in windows, how can it be edited and why might it need to be edited.   ", "id": 135, "page": "16_IN16_IP9"},
{"q": " Return the length of the longest numerical sequence from a list   ", "id": 136, "page": "16_IN16_IP9"},
{"q": " What benefits are you aware of that Google provide to staff?   ", "id": 137, "page": "16_IN16_IP9"},
{"q": " Parse a IPv4 address using RegEx   ", "id": 138, "page": "16_IN16_IP9"},
{"q": " Tell me something about yourself that's not on your resume   ", "id": 139, "page": "16_IN16_IP9"},
{"q": " Do you know what protocol is used in ping packet?   ", "id": 140, "page": "16_IN16_IP9"}
]