[
{"count": " 75 Candidate Interview Reviews"},
{"q": " How do you handle pressure and give examples   ", "id": 1, "page": "19_IN16"},
{"q": " count the occurrences of a letter in a string   ", "id": 2, "page": "19_IN16"},
{"q": " Coin vending problem   ", "id": 3, "page": "19_IN16"},
{"q": " Creating words from a 2D grid of letters", "id": 4, "page": "19_IN16"},
{"q": "Other general questions   ", "id": 5, "page": "19_IN16"},
{"q": " They asked stuff about my resume   ", "id": 6, "page": "19_IN16"},
{"q": " Have you applied for other internships?   ", "id": 7, "page": "19_IN16"},
{"q": " Given an integer number, implement the toString() function of that number.   ", "id": 8, "page": "19_IN16"},
{"q": " When was a time where you had to change something unexpectedly about a project and tell me about that experience?   ", "id": 9, "page": "19_IN16"},
{"q": " Standard algorithms questions.   ", "id": 10, "page": "19_IN16"},
{"q": " Standard coding questions.   ", "id": 11, "page": "19_IN16"},
{"q": " Do you enjoy working with a wide range of people?   ", "id": 12, "page": "19_IN16_IP2"},
{"q": " Describe the biggest technical problem you faced in any of your projects and how did you solve it?   ", "id": 13, "page": "19_IN16_IP2"},
{"q": " Q: Provide an example where you have shown leadership   ", "id": 14, "page": "19_IN16_IP2"},
{"q": " What is a challenge you have faced? What did you learn and what would you do different if you had a chance?", "id": 15, "page": "19_IN16_IP2"},
{"q": "How do your passions and motivation set you apart from other applicants?", "id": 16, "page": "19_IN16_IP2"},
{"q": "Why did you apply for this position and how does it help you with your career aspirations?   ", "id": 17, "page": "19_IN16_IP2"},
{"q": " Given a business case study on Office 360 and as a group had to do a presentation   ", "id": 18, "page": "19_IN16_IP2"},
{"q": " I was asked traditional behavioural questions, such as \"why Microsoft\"   ", "id": 19, "page": "19_IN16_IP2"},
{"q": " Although we would be hiring you to represent a certain product set, what would you response be if we were to withdraw from that particular market?   ", "id": 20, "page": "19_IN16_IP2"},
{"q": " Design a elevator system   ", "id": 21, "page": "19_IN16_IP2"},
{"q": " Have you ever worked in Sales before?   ", "id": 22, "page": "19_IN16_IP2"},
{"q": " Why did you apply for this role? What experience is relevant?   ", "id": 23, "page": "19_IN16_IP3"},
{"q": " Why microsoft?", "id": 24, "page": "19_IN16_IP3"},
{"q": "Tell me about yourself?", "id": 25, "page": "19_IN16_IP3"},
{"q": "Tell me about a success?", "id": 26, "page": "19_IN16_IP3"},
{"q": "Tell me about a failure?", "id": 27, "page": "19_IN16_IP3"},
{"q": "Tell me about a time you sold something to someone who didnt have a need?", "id": 28, "page": "19_IN16_IP3"},
{"q": "Time management questions, also questions about how you can be autonomous, intrinsic motivation question   ", "id": 29, "page": "19_IN16_IP3"},
{"q": " Implement a circular buffer on paper.   ", "id": 30, "page": "19_IN16_IP3"},
{"q": " A algorithm problem with O(1) space.   ", "id": 31, "page": "19_IN16_IP3"},
{"q": " You are given a 2d array of characters, as well as a list of words. Your job is to find all of the words that occur in this 2d array. Words can be formed by moving in all directions (diagonal included).", "id": 32, "page": "19_IN16_IP3"},
{"q": "You are allowed to pre-process the words however you like.   ", "id": 33, "page": "19_IN16_IP3"},
{"q": " Algorithm based question   ", "id": 34, "page": "19_IN16_IP3"},
{"q": " The interviewer asked a question about sorting cards. Given a complete set of cards, you should sort them without using extra space.   ", "id": 35, "page": "19_IN16_IP3"},
{"q": " 1.Add an element to a sorted linked List.", "id": 36, "page": "19_IN16_IP3"},
{"q": "2.Convert a String which represents a floating point number to a double.", "id": 37, "page": "19_IN16_IP3"},
{"q": "3. Find peak element in array.(Peak element is one that is greater than its neighbors).", "id": 38, "page": "19_IN16_IP3"},
{"q": "4.Design a a function that verifies whether you have captured the white or black disks in Reverse game.   ", "id": 39, "page": "19_IN16_IP3"},
{"q": " How would you implement a game like candy crush?   ", "id": 40, "page": "19_IN16_IP3"},
{"q": " Questions on linked lists, traversing trees, strings, and various other questions about algorithms and data structures.   ", "id": 41, "page": "19_IN16_IP3"},
{"q": " First round: Design a Tic Tac Toe AI, design it for embedded systems   ", "id": 42, "page": "19_IN16_IP4"},
{"q": " Why did you choose Microsoft to apply?   ", "id": 43, "page": "19_IN16_IP4"},
{"q": " Talk about technique problems in your project.   ", "id": 44, "page": "19_IN16_IP4"},
{"q": " Design an algorithm in C for some string-processing task (can't remember the details)   ", "id": 45, "page": "19_IN16_IP4"},
{"q": " What assembly instruction can be used to ensure atomic access for people entering/exiting a hypothetical garden with one gate   ", "id": 46, "page": "19_IN16_IP4"},
{"q": " Write an algorithm to convert from RGB to HSV   ", "id": 47, "page": "19_IN16_IP4"},
{"q": " One-on-one. Take this time to show the interviewer your personal projects and achievements.   ", "id": 48, "page": "19_IN16_IP4"},
{"q": " To implement a circular buffer   ", "id": 49, "page": "19_IN16_IP4"},
{"q": " Find the number of '0' bits in an integer.   ", "id": 50, "page": "19_IN16_IP4"},
{"q": " N people in a party consisting of celebrities and normal people. All normal people know the celebrities but celebrities don't know anyone but themselves. Write code to find the celebrity.   ", "id": 51, "page": "19_IN16_IP4"},
{"q": " Given an integer as input, return the number of 1s in the input's binary form.   ", "id": 52, "page": "19_IN16_IP4"},
{"q": " This one took me by surprise: write a function in C that will verify if an IPv4 address is correct or not.   ", "id": 53, "page": "19_IN16_IP4"},
{"q": " Write a function to reverse an integer (i.e. 123 = 321), with O(1) space complexity.   ", "id": 54, "page": "19_IN16_IP4"},
{"q": " Write a function to print all paths of a binary tree to a certain depth/length.   ", "id": 55, "page": "19_IN16_IP4"},
{"q": " How do you test a website?   ", "id": 56, "page": "19_IN16_IP4"},
{"q": " Questions about hardware, memory allocations, pointers!   ", "id": 57, "page": "19_IN16_IP5"},
{"q": " The third question is a bit unexpected. I was spending a lot of time thinking how to write this efficiently, but didn't finish it. I should just write a straight forward one, and try to improve it later.   ", "id": 58, "page": "19_IN16_IP5"},
{"q": " I was asked to count from 1 to N among M people in a loop. People counted as N will be removed and keeping counting from 1 to N until only one people left. Output the position of the last people.   ", "id": 59, "page": "19_IN16_IP5"},
{"q": " I was asked to think of ways to reduce memory usage / make it more efficient for the Windows Help files. This was asked in my second interview. I tried to think of suggestions but none seemed to click with what the interviewer had in mind.   ", "id": 60, "page": "19_IN16_IP5"},
{"q": " Draw the system architecture of one of your projects   ", "id": 61, "page": "19_IN16_IP5"},
{"q": " Remove all duplicates from an integer array without using any additional data structures.   ", "id": 62, "page": "19_IN16_IP5"},
{"q": " What social media strategy do you use for yourself?   ", "id": 63, "page": "19_IN16_IP5"},
{"q": " Why did you want to join Microsoft   ", "id": 64, "page": "19_IN16_IP5"},
{"q": " I was given a number of technical challenges which I think I handled OK. The most intriguing question was \"what would your wife say is your biggest mistake?\". As I wasn't married at the time, this threw me somewhat   ", "id": 65, "page": "19_IN16_IP5"},
{"q": " Nothing unusual.", "id": 66, "page": "19_IN16_IP5"},
{"q": "Strengths ?   ", "id": 67, "page": "19_IN16_IP5"},
{"q": " What's one of the biggest challenges you've faced and how did you overcome it?   ", "id": 68, "page": "19_IN16_IP6"},
{"q": " You have a 5-sided die. You need to produce a uniform random number between 1-7. You can re-roll the die as much as you need. How do you achieve this?   ", "id": 69, "page": "19_IN16_IP6"},
{"q": " Tell me about a work event where you had to exert influence over somebody who you had no control but relied on their help for your outcome.   ", "id": 70, "page": "19_IN16_IP6"},
{"q": " Give me an example of how you have worked both at a strategic level in an organization as well as more directly to have an impact?   ", "id": 71, "page": "19_IN16_IP6"},
{"q": " Which Microsoft product would you change, why and how?   ", "id": 72, "page": "19_IN16_IP6"},
{"q": " How do you think we can beat Apple?   ", "id": 73, "page": "19_IN16_IP6"},
{"q": " Describe how you would approach your first 180 days to deliver success in role?   ", "id": 74, "page": "19_IN16_IP6"},
{"q": " How have you dealt with conflict with a colleague?   ", "id": 75, "page": "19_IN16_IP6"},
{"q": " What have you heard about Azure in the news recently?   ", "id": 76, "page": "19_IN16_IP6"},
{"q": " Tell me about an opportunity in which you were faced with an objection to overcome   ", "id": 77, "page": "19_IN16_IP6"},
{"q": " Would you recruit a potential partner who had strong technical skills but had yet to move their business to the cloud or a potential partner who was already committed to the cloud but hadn't looked at or leverage an Azure workload?   ", "id": 78, "page": "19_IN16_IP6"},
{"q": " What has been your greatest career achievement to date   ", "id": 79, "page": "19_IN16_IP6"},
{"q": " Distributed system design   ", "id": 80, "page": "19_IN16_IP6"},
{"q": " Behavioural based interviews - don't recall specifics   ", "id": 81, "page": "19_IN16_IP6"},
{"q": " I was not expecting the question to be as complicated as a game but it turn out that you would not be expected to complete the functionalities but just provide your logic flows.   ", "id": 82, "page": "19_IN16_IP6"},
{"q": " How can you define a good technology and a better technology ?   ", "id": 83, "page": "19_IN16_IP7"},
{"q": " What is the customer service?", "id": 84, "page": "19_IN16_IP7"},
{"q": "What software do you like to use and what recommendation would you give to improve it?   ", "id": 85, "page": "19_IN16_IP7"},
{"q": " Tell me what happens when you click the power button on a PC.   ", "id": 86, "page": "19_IN16_IP7"},
{"q": " Technical coding interviews, not too difficult, strong focus on writing functions   ", "id": 87, "page": "19_IN16_IP7"},
{"q": " How would you deal with a difficult situation with a client, where a partner might be needed?   ", "id": 88, "page": "19_IN16_IP7"},
{"q": " What do you know about CRM?   ", "id": 89, "page": "19_IN16_IP7"},
{"q": " What's the current share price?   ", "id": 90, "page": "19_IN16_IP7"},
{"q": " Reverse the words in a sentence given as a string. Behavioral questions.   ", "id": 91, "page": "19_IN16_IP7"},
{"q": " Minimum height that an egg will broke.   ", "id": 92, "page": "19_IN16_IP7"},
{"q": " The asked two hashmap questions, one object oriented design question, and one recursive problem.   ", "id": 93, "page": "19_IN16_IP7"},
{"q": " How to reverse a linked list   ", "id": 94, "page": "19_IN16_IP7"},
{"q": " Asked a question about how I would store a painting that contained shapes, which contained points. Didn't realise the interviewer expected me to do a system design, awkwardly talked to her for half an hour about what she meant.   ", "id": 95, "page": "19_IN16_IP7"},
{"q": " Why Microsoft?   ", "id": 96, "page": "19_IN16_IP8"},
{"q": " Write a function that accepts a string parameter", "id": 97, "page": "19_IN16_IP8"},
{"q": "and returns the longest repeated substring in that string.", "id": 98, "page": "19_IN16_IP8"},
{"q": "Repeated substrings must not overlap.", "id": 99, "page": "19_IN16_IP8"},
{"q": "For example, consider this string: ababcabc.", "id": 100, "page": "19_IN16_IP8"},
{"q": "The repeated substrings include a, ab, bc, and abc.", "id": 101, "page": "19_IN16_IP8"},
{"q": "The longest repeated substring that does not overlap is abc.   ", "id": 102, "page": "19_IN16_IP8"},
{"q": " Given 2 linked lists, write a function to check if they merges into one.   ", "id": 103, "page": "19_IN16_IP8"},
{"q": " When have you had to work under someones guidance or supervision? Did it work well or not?   ", "id": 104, "page": "19_IN16_IP8"},
{"q": " Give an example of a time where you had to solve a problem you didn't know how to solve.   ", "id": 105, "page": "19_IN16_IP8"},
{"q": " Technical Question: Given a linked list, reverse its order.   ", "id": 106, "page": "19_IN16_IP8"},
{"q": " What are the effects of a good/bad leader and provide an example of a time when you dealt with each   ", "id": 107, "page": "19_IN16_IP8"}
]